tutorials/heatTransfer/buoyantSimpleFoam/buoyantCavity/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    ( 0     0  -260)
    (76     0  -260)
    (76  2180  -260)
    ( 0  2180  -260)
    ( 0     0   260)
    (76     0   260)
    (76  2180   260)
    ( 0  2180   260)
);

edges
(
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (35 150 15) simpleGrading (1 1 1)
);

patches
(
    wall frontAndBack
    (
        (0 1 5 4)
        (2 3 7 6)
    )

    wall topAndBottom
    (
        (4 5 6 7)
        (3 2 1 0)
    )

    wall hot
    (
        (6 5 1 2)
    )

    wall cold
    (
        (4 7 3 0)
    )
);

mergePatchPairs
(
);

